; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v7 ?v5)
		(pred_3 ?v8)
		(pred_1 ?v2)
		(pred_4 ?v2)
		(pred_5 ?v8 ?v2)
		(pred_6)
		(pred_2 ?v8))

   (:action op_3
       :parameters  (?v4 ?v1)
       :precondition (and (not-eq ?v4 ?v1) 
                          (pred_1 ?v4) (pred_1 ?v1) (pred_4 ?v4))
       :effect (and  (pred_4 ?v1)
		     (not (pred_4 ?v4))))


   (:action op_2
       :parameters (?v6 ?v3)
       :precondition  (and  (pred_3 ?v6) (pred_1 ?v3)
			    (pred_5 ?v6 ?v3) (pred_4 ?v3) (pred_6))
       :effect (and (pred_2 ?v6)
		    (not (pred_5 ?v6 ?v3)) 
		    (not (pred_6))))

   (:action op_1
       :parameters  (?v6  ?v3)
       :precondition  (and  (pred_3 ?v6) (pred_1 ?v3)
			    (pred_2 ?v6) (pred_4 ?v3))
       :effect (and (pred_5 ?v6 ?v3)
		    (pred_6)
		    (not (pred_2 ?v6)))))

; problem
(define (problem ferry-l6-c2)
(:domain ferry)
(:objects obj_07 obj_04 obj_05 obj_03 obj_02 obj_06 
          obj_08 obj_01 
)
(:init
(pred_1 obj_07)
(pred_1 obj_04)
(pred_1 obj_05)
(pred_1 obj_03)
(pred_1 obj_02)
(pred_1 obj_06)
(pred_3 obj_08)
(pred_3 obj_01)
(not-eq obj_07 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_05)
(not-eq obj_05 obj_07)
(not-eq obj_07 obj_03)
(not-eq obj_03 obj_07)
(not-eq obj_07 obj_02)
(not-eq obj_02 obj_07)
(not-eq obj_07 obj_06)
(not-eq obj_06 obj_07)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_05 obj_03)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_05)
(not-eq obj_03 obj_02)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_06)
(not-eq obj_06 obj_03)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_02)
(pred_6)
(pred_5 obj_08 obj_02)
(pred_5 obj_01 obj_05)
(pred_4 obj_05)
)
(:goal
(and
(pred_5 obj_08 obj_06)
(pred_5 obj_01 obj_06)
)
)

(:constraints
  (and
    (sometime-before  (pred_5 obj_08 obj_06) (pred_4 obj_07))
    (sometime-before  (pred_5 obj_01 obj_06) (pred_4 obj_07))
  )
)
)

; plan
1. (op_2 obj_01 obj_05)
   deleted: (pred_5 obj_01 obj_05) (pred_6)
   added: (pred_2 obj_01)
   goals met: 0 of 2
2. (op_3 obj_05 obj_06)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_06)
   goals met: 0 of 2
3. (op_3 obj_06 obj_02)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_02)
   goals met: 0 of 2
4. (op_1 obj_01 obj_02)
   deleted: (pred_2 obj_01)
   added: (pred_5 obj_01 obj_02) (pred_6)
   goals met: 0 of 2
5. (op_2 obj_08 obj_02)
   deleted: (pred_5 obj_08 obj_02) (pred_6)
   added: (pred_2 obj_08)
   goals met: 0 of 2
6. (op_3 obj_02 obj_07)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_07)
   goals met: 0 of 2
7. (op_1 obj_08 obj_07)
   deleted: (pred_2 obj_08)
   added: (pred_5 obj_08 obj_07) (pred_6)
   goals met: 0 of 2
8. (op_3 obj_07 obj_02)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_02)
   goals met: 0 of 2
9. (op_2 obj_01 obj_02)
   deleted: (pred_5 obj_01 obj_02) (pred_6)
   added: (pred_2 obj_01)
   goals met: 0 of 2
10. (op_3 obj_02 obj_06)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_06)
   goals met: 0 of 2
11. (op_1 obj_01 obj_06)
   deleted: (pred_2 obj_01)
   added: (pred_5 obj_01 obj_06) (pred_6)
   goals met: 1 of 2
12. (op_3 obj_06 obj_07)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_07)
   goals met: 1 of 2
13. (op_2 obj_08 obj_07)
   deleted: (pred_5 obj_08 obj_07) (pred_6)
   added: (pred_2 obj_08)
   goals met: 1 of 2
14. (op_3 obj_07 obj_06)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_06)
   goals met: 1 of 2
15. (op_1 obj_08 obj_06)
   deleted: (pred_2 obj_08)
   added: (pred_5 obj_08 obj_06) (pred_6)
   goals met: 2 of 2
